artillery/tests/word-search-high-load.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 20
      arrivalRate: 10
      name: Warm up low load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Ramp up load
    - duration: 60
      arrivalRate: 60
      name: Sustained load
scenarios:
  - name: "Search words 'Bilbo'"
    flow:
      - get:
          url: "/files/hobbit.txt/searchWord?word=Bilbo"
  - name: "Search words 'of'"
    flow:
      - get:
          url: "/files/hobbit.txt/searchWord?word=and"
  - name: "Search words 'in'"
    flow:
      - get:
          url: "/files/hobbit.txt/searchWord?word=in"
  - name: "Search words 'at'"
    flow:
      - get:
          url: "/files/hobbit.txt/searchWord?word=at"